In [1]:
import pandas as pd

In [2]:
use = ['loan_amnt', 'int_rate', 'term', 'loan_status','grade']
df1 = pd.read_csv('./data/loan/accepted_2007_to_2018Q4.csv', usecols = use)
df1

         loan_amnt        term  int_rate grade  loan_status
0           3600.0   36 months     13.99     C   Fully Paid
1          24700.0   36 months     11.99     C   Fully Paid
2          20000.0   60 months     10.78     B   Fully Paid
3          35000.0   60 months     14.85     C      Current
4          10400.0   60 months     22.45     F   Fully Paid
...            ...         ...       ...   ...          ...
2260696    40000.0   60 months     10.49     B      Current
2260697    24000.0   60 months     14.49     C  Charged Off
2260698    14000.0   60 months     14.49     C      Current
2260699        NaN         NaN       NaN   NaN          NaN
2260700        NaN         NaN       NaN   NaN          NaN

[2260701 rows x 5 columns]

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2260701 entries, 0 to 2260700
Data columns (total 5 columns):
 #   Column       Dtype
---  ------       -----
 0   loan_amnt    float64
 1   term         object
 2   int_rate     float64
 3   grade        object
 4   loan_status  object
dtypes: float64(2), object(3)
memory usage: 86.2+ MB

In [4]:
df1.isnull().sum()

loan_amnt      33
term           33
int_rate       33
grade          33
loan_status    33
dtype: int64

In [5]:
df2 = df1.copy()
df3 = df2.dropna()
df3

         loan_amnt        term  int_rate grade  loan_status
0           3600.0   36 months     13.99     C   Fully Paid
1          24700.0   36 months     11.99     C   Fully Paid
2          20000.0   60 months     10.78     B   Fully Paid
3          35000.0   60 months     14.85     C      Current
4          10400.0   60 months     22.45     F   Fully Paid
...            ...         ...       ...   ...          ...
2260694    24000.0   60 months     12.79     C      Current
2260695    24000.0   60 months     10.49     B      Current
2260696    40000.0   60 months     10.49     B      Current
2260697    24000.0   60 months     14.49     C  Charged Off
2260698    14000.0   60 months     14.49     C      Current

[2260668 rows x 5 columns]

In [6]:
df3['term'].unique()

array([' 36 months', ' 60 months'], dtype=object)

In [7]:
total_36 = df3.loc[df3['term'] == ' 36 months', 'loan_amnt'].sum()
total_36

20517162875.0

In [8]:
total_60 = df3.loc[df3['term'] == ' 60 months', 'loan_amnt'].sum()
total_60

13498953050.0

In [9]:
df3['loan_status'].unique()

array(['Fully Paid', 'Current', 'Charged Off', 'In Grace Period',
       'Late (31-120 days)', 'Late (16-30 days)', 'Default',
       'Does not meet the credit policy. Status:Fully Paid',
       'Does not meet the credit policy. Status:Charged Off'],
      dtype=object)

In [10]:
conditions1 = ['Charged Off', 'Late (31-120 days)', 'Late (16-30 days)', 'Default', 'Does not meet the credit policy. Status:Fully Paid','Does not meet the credit policy. Status:Charged Off']
df4 = df3[df3['loan_status'].isin(conditions1)]
df4

         loan_amnt        term  int_rate grade  loan_status
13         18000.0   60 months     19.48     E  Charged Off
25          4225.0   36 months     14.85     C  Charged Off
30         16000.0   36 months     12.88     C  Charged Off
31         24250.0   60 months     24.24     F  Charged Off
33         25000.0   60 months     13.99     C  Charged Off
...            ...         ...       ...   ...          ...
2260673    32000.0   60 months     13.99     C  Charged Off
2260677    11200.0   60 months     13.49     C  Charged Off
2260685    36400.0   60 months     14.49     C  Charged Off
2260691    32000.0   60 months     14.49     C  Charged Off
2260697    24000.0   60 months     14.49     C  Charged Off

[297164 rows x 5 columns]

In [11]:
df5 = df3[~df3['loan_status'].isin(conditions1)]
df5

         loan_amnt        term  int_rate grade loan_status
0           3600.0   36 months     13.99     C  Fully Paid
1          24700.0   36 months     11.99     C  Fully Paid
2          20000.0   60 months     10.78     B  Fully Paid
3          35000.0   60 months     14.85     C     Current
4          10400.0   60 months     22.45     F  Fully Paid
...            ...         ...       ...   ...         ...
2260693    24000.0   60 months     10.49     B     Current
2260694    24000.0   60 months     12.79     C     Current
2260695    24000.0   60 months     10.49     B     Current
2260696    40000.0   60 months     10.49     B     Current
2260698    14000.0   60 months     14.49     C     Current

[1963504 rows x 5 columns]

In [12]:
df4.value_counts('grade')

grade
C    95316
D    67488
B    58711
E    39145
A    15967
F    15508
G     5029
Name: count, dtype: int64

In [13]:
df4.value_counts('grade', normalize = True)

grade
C    0.320752
D    0.227107
B    0.197571
E    0.131729
A    0.053731
F    0.052187
G    0.016923
Name: proportion, dtype: float64

In [14]:
df5.value_counts('grade')

grade
B    604846
C    554737
A    417060
D    256936
E     96494
F     26292
G      7139
Name: count, dtype: int64

In [15]:
df5.value_counts('grade', normalize = True)

grade
B    0.308044
C    0.282524
A    0.212406
D    0.130856
E    0.049144
F    0.013390
G    0.003636
Name: proportion, dtype: float64

In [18]:
df3[['loan_amnt', 'int_rate']].corr()

           loan_amnt  int_rate
loan_amnt   1.000000  0.098082
int_rate    0.098082  1.000000